tests/load/load-test-config.yml
# Artillery Load Testing Configuration
# Tests authentication system performance under load

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm up"

    # Normal load
    - duration: 120
      arrivalRate: 50
      name: "Normal load"

    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"

    # Stress test
    - duration: 30
      arrivalRate: 150
      name: "Stress test"

  processor: "./load-test-functions.js"

  # Default headers
  defaults:
    headers:
      Content-Type: "application/json"

# Scenarios
scenarios:

  # Scenario 1: User Registration
  - name: "User Registration Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            full_name: "Load Test User {{ $randomString() }}"
            email: "loadtest-{{ $randomString() }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.message"
              as: "registrationMessage"
      - think: 2

  # Scenario 2: User Login
  - name: "User Login Flow"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "testuser@example.com"
            password: "TestPassword123!"
            remember_me: false
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.id"
              as: "userId"
      - think: 1
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 1

  # Scenario 3: Password Reset Request
  - name: "Password Reset Flow"
    weight: 15
    flow:
      - post:
          url: "/api/auth/forgot-password"
          json:
            email: "testuser@example.com"
          capture:
            - json: "$.message"
              as: "resetMessage"
      - think: 3

  # Scenario 4: OAuth Initiation
  - name: "OAuth Flow"
    weight: 15
    flow:
      - get:
          url: "/api/auth/oauth/google"
          capture:
            - regexp: "(https://accounts\\.google\\.com/.*?)"
              as: "googleAuthUrl"
      - think: 2

  # Scenario 5: Protected API Access
  - name: "Authenticated API Access"
    weight: 10
    flow:
      # First login to get token
      - post:
          url: "/api/auth/login"
          json:
            email: "testuser@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      # Make multiple authenticated requests
      - loop:
          count: 5
          flow:
            - get:
                url: "/api/auth/me"
                headers:
                  Authorization: "Bearer {{ authToken }}"
            - think: 0.5

# Before each test, ensure test user exists
before:
  - flow:
      - post:
          url: "/api/auth/register"
          json:
            full_name: "Load Test User"
            email: "testuser@example.com"
            password: "TestPassword123!"
          # Ignore if already exists
          expect:
            - statusCode: [200, 201, 400]

# After test, optionally cleanup
after:
  - flow:
      - log: "Load test completed"